<template>
  <div class="goodsdesc">
    <h3>kkkkk</h3>
    <hr>
    <div class="content">
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
      华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅 华为手机256G全新大屏，更流畅
    </div>
  </div>
</template>

<script>
// export default {
//   data () {
//     return {
//       arr: [],
//       arr2: '',
//       id2: this.$route.params.id - 1, // 获得url中传过来的id，从而获取到具体的商品信息
//       goodsdesc: [
//         { id: 1, desc: '华为', title: '华为手机详情' },
//         { id: 2, desc: '苹果', title: '苹果手机详情' },
//         { id: 3, desc: '小米', title: '小米手机详情' },
//         { id: 4, desc: '三星', title: '三星手机详情' },
//         { id: 5, desc: 'oppo', title: 'oppo手机详情' }
//       ]
//     }
//   },
//   created () {
//     this.pushArr()
//   },
//   methods: {
//     pushArr () {
//       // 把this.$route.parmas中的id获取之后，把具体的单条信息传给arr数组
//       this.arr.push(this.goodsdesc[this.id2])
//       // arr2 是为了处理购买时最大值的问题，使arr2是arr中去掉数组，得到的是一个单纯的对象
//       this.arr2 = this.arr[0]
//     }
//   }
// }
</script>

<style>
.goodsdesc{
    padding:5px;
}
h3 {
  text-align: center;
  columns: #226af2;
}

.content {
  color: #999;
}
</style>
